// SPDX-License-Identifier: LGPL-3.0-or-later
//
// (c) SYSTEC electronic AG, D-08468 Heinsdorfergrund, Am Windrad 2
//     www.systec-electronic.com

#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]

// This provides the Foreign Function Interface (FFI) for the C API of
// libctr700drv.so.
// Initially, it has been created by Rust bindgen from ctr700drv.h.

use crate::sysworxx_io::*;
use std::sync::{Arc, Mutex};

const SPECIAL_INPUT_RUN_SWITCH: u8 = 0x80;
const RUN_SWITCH_CHANNEL: u8 = 0x26;

#[doc = "< Function call succeeded"]
pub const kCtr700DrvResult_Success: tCtr700DrvResult = 0;
#[doc = "< Generic error occurred"]
pub const kCtr700DrvResult_Error: tCtr700DrvResult = 255;
#[doc = "< The functionality is not implemented by the library"]
pub const kCtr700DrvResult_NotImplemented: tCtr700DrvResult = 254;
#[doc = "< One of the given parameters is invalid (e.g. NULL pointer or parameter is out of range)"]
pub const kCtr700DrvResult_InvalidParameter: tCtr700DrvResult = 253;
#[doc = "< The provided channel number is invalid"]
pub const kCtr700DrvResult_InvalidChannel: tCtr700DrvResult = 252;
#[doc = "< The provided mode is invalid"]
pub const kCtr700DrvResult_InvalidMode: tCtr700DrvResult = 251;
#[doc = "< The provided timebase is invalid"]
pub const kCtr700DrvResult_InvalidTimebase: tCtr700DrvResult = 250;
#[doc = "< The provided delta parameter is invalid"]
pub const kCtr700DrvResult_InvalidDelta: tCtr700DrvResult = 249;

#[doc = " The counter will count in A/B decoder mode. Digital input 14 is used"]
#[doc = " for the 'A' input and digital input 15 is used for 'B'. Switching the"]
#[doc = " inputs will result in inverse counting."]
pub const kCtr700DrvCounterMode_AB_Decoder: tCtr700DrvCounterMode = 1;
#[doc = " @brief Counter mode type"]
pub type tCtr700DrvCounterMode = ::std::os::raw::c_uint;
pub const kCtr700DrvCounterTrigger_RisingEdge: tCtr700DrvCounterTrigger = 0;
pub const kCtr700DrvCounterTrigger_FallingEdge: tCtr700DrvCounterTrigger = 1;
pub const kCtr700DrvCounterTrigger_AnyEdge: tCtr700DrvCounterTrigger = 2;
#[doc = " @brief Counter trigger type (only applies to #kCtr700DrvCounterMode_Counter"]
pub type tCtr700DrvCounterTrigger = ::std::os::raw::c_uint;
pub const kCtr700DrvCounterDirection_Up: tCtr700DrvCounterDirection = 0;
pub const kCtr700DrvCounterDirection_Down: tCtr700DrvCounterDirection = 1;
#[doc = " @brief Counter direction type can be used to invert the direction of"]
#[doc = "        counting."]
pub type tCtr700DrvCounterDirection = ::std::os::raw::c_uint;
pub const kCtr700DrvPwm_Channel0: tCtr700DrvPwm = 0;
pub const kCtr700DrvPwm_Channel1: tCtr700DrvPwm = 1;
#[doc = " @brief PWM channel type"]
pub type tCtr700DrvPwm = ::std::os::raw::c_uint;
pub const kCtr700DrvPwmTimebase_800NS: tCtr700DrvPwmTimebase = 1;
pub const kCtr700DrvPwmTimebase_1MS: tCtr700DrvPwmTimebase = 2;
#[doc = " @brief PWM timebase type"]
pub type tCtr700DrvPwmTimebase = ::std::os::raw::c_uint;
#[doc = "< Internal temperature sensor of the i.MX7"]
pub const kCtr700DrvTmp_Channel0: tCtr700DrvTmp = 0;
#[doc = "< Temperature sensor on the system PCB of sysWORXX CTR-700"]
pub const kCtr700DrvTmp_Channel1: tCtr700DrvTmp = 1;
#[doc = " @brief Temperature sensor type"]
pub type tCtr700DrvTmp = ::std::os::raw::c_uint;
#[doc = " @brief Hardware information structure"]
#[doc = ""]
#[doc = " This structure will be filled by #Ctr700DrvGetHardwareInfo. It contains the"]
#[doc = " revision information as well as the channel counts for the different"]
#[doc = " peripherals."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tCtr700DrvHwInfo {
    #[doc = "< The PCB revision number"]
    pub m_uPcbRevision: u16,
    #[doc = "< Number of digital inputs"]
    pub m_uDiChannels: u16,
    #[doc = "< Number of digital outputs"]
    pub m_uDoChannels: u16,
    #[doc = "< Number of relay outputs"]
    pub m_uRelayChannels: u16,
    #[doc = "< Number of analog inputs"]
    pub m_uAiChannels: u16,
    #[doc = "< Number of analog outputs"]
    pub m_uAoChannels: u16,
    #[doc = "< Number of counter channels"]
    pub m_uCntChannels: u16,
    #[doc = "< Number of A/B decoder channels"]
    pub m_uEncChannels: u16,
    #[doc = "< Number of PWM channels"]
    pub m_uPwmChannels: u16,
    #[doc = "< Number of temperature channels"]
    pub m_uTmpChannels: u16,
}
#[test]
fn bindgen_test_layout_tCtr700DrvHwInfo() {
    assert_eq!(
        ::std::mem::size_of::<tCtr700DrvHwInfo>(),
        20usize,
        concat!("Size of: ", stringify!(tCtr700DrvHwInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<tCtr700DrvHwInfo>(),
        2usize,
        concat!("Alignment of ", stringify!(tCtr700DrvHwInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tCtr700DrvHwInfo>())).m_uPcbRevision as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tCtr700DrvHwInfo),
            "::",
            stringify!(m_uPcbRevision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tCtr700DrvHwInfo>())).m_uDiChannels as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(tCtr700DrvHwInfo),
            "::",
            stringify!(m_uDiChannels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tCtr700DrvHwInfo>())).m_uDoChannels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tCtr700DrvHwInfo),
            "::",
            stringify!(m_uDoChannels)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tCtr700DrvHwInfo>())).m_uRelayChannels as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(tCtr700DrvHwInfo),
            "::",
            stringify!(m_uRelayChannels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tCtr700DrvHwInfo>())).m_uAiChannels as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tCtr700DrvHwInfo),
            "::",
            stringify!(m_uAiChannels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tCtr700DrvHwInfo>())).m_uAoChannels as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(tCtr700DrvHwInfo),
            "::",
            stringify!(m_uAoChannels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tCtr700DrvHwInfo>())).m_uCntChannels as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tCtr700DrvHwInfo),
            "::",
            stringify!(m_uCntChannels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tCtr700DrvHwInfo>())).m_uEncChannels as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(tCtr700DrvHwInfo),
            "::",
            stringify!(m_uEncChannels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tCtr700DrvHwInfo>())).m_uPwmChannels as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tCtr700DrvHwInfo),
            "::",
            stringify!(m_uPwmChannels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tCtr700DrvHwInfo>())).m_uTmpChannels as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(tCtr700DrvHwInfo),
            "::",
            stringify!(m_uTmpChannels)
        )
    );
}
#[doc = " @brief Diagnose information structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tCtr700DrvDiagInfo {
    #[doc = " @brief Signals powerfail errors of the driver for digital outputs (**active high**)"]
    #[doc = ""]
    #[doc = " This signal will be active, when the power supply for digital outputs"]
    #[doc = " is not properly connected."]
    pub m_fDigiOutPowerFail: u8,
    #[doc = " @brief Signals an error for digital outputs (**active low**)"]
    #[doc = ""]
    #[doc = " This error signal will be active in one of two cases:"]
    #[doc = " - overtemperature error of the driver IC"]
    #[doc = " - internal communication error of the driver IC"]
    pub m_fDigiOutDiag: u8,
    #[doc = " @brief Signals an error for digital inputs (**active low**)"]
    #[doc = ""]
    #[doc = " This error signal will be active in one of two cases:"]
    #[doc = " - power supply is not connected to the driver IC"]
    #[doc = " - internal communication error of the driver IC"]
    pub m_fDigiInError: u8,
    #[doc = " @brief Signals an over-current error on USB interface (**active low**)"]
    pub m_fUsbOverCurrent: u8,
}
#[test]
fn bindgen_test_layout_tCtr700DrvDiagInfo() {
    assert_eq!(
        ::std::mem::size_of::<tCtr700DrvDiagInfo>(),
        4usize,
        concat!("Size of: ", stringify!(tCtr700DrvDiagInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<tCtr700DrvDiagInfo>(),
        1usize,
        concat!("Alignment of ", stringify!(tCtr700DrvDiagInfo))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tCtr700DrvDiagInfo>())).m_fDigiOutPowerFail as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tCtr700DrvDiagInfo),
            "::",
            stringify!(m_fDigiOutPowerFail)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tCtr700DrvDiagInfo>())).m_fDigiOutDiag as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(tCtr700DrvDiagInfo),
            "::",
            stringify!(m_fDigiOutDiag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tCtr700DrvDiagInfo>())).m_fDigiInError as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(tCtr700DrvDiagInfo),
            "::",
            stringify!(m_fDigiInError)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tCtr700DrvDiagInfo>())).m_fUsbOverCurrent as *const _ as usize
        },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(tCtr700DrvDiagInfo),
            "::",
            stringify!(m_fUsbOverCurrent)
        )
    );
}
#[doc = " @brief Callback function type for asynchronous handling of digital inputs"]
pub type tCtr700DrvInterruptCallback =
    ::std::option::Option<unsafe extern "C" fn(arg1: u8, arg2: u8)>;
#[doc = "< Disable interrupt handling for the channel"]
pub const kCtr700DrvInterruptNone: tCtr700DrvInterruptTrigger = 0;
#[doc = "< Enable interrupt handling if the input value changes from low to high"]
pub const kCtr700DrvInterruptRisingEdge: tCtr700DrvInterruptTrigger = 1;
#[doc = "< Enable interrupt handling if the input value changes from high to low"]
pub const kCtr700DrvInterruptFallingEdge: tCtr700DrvInterruptTrigger = 2;
#[doc = "< Enable interrupt handling if the input value changes any way"]
pub const kCtr700DrvInterruptBothEdge: tCtr700DrvInterruptTrigger = 3;
#[doc = " @brief Trigger type for asynchronous digital input handling"]
